{
  "name": null,
  "email": null,
  "phone": null,
  "linkedin": null,
  "github": null,
  "portfolio": null,
  "summary": "CV parsing failed: LLM JSON generation failed: LLM request timed out. Try a smaller model or reduce prompt size.. Using raw text.",
  "experiences": [],
  "projects": [],
  "skills": [],
  "education": [],
  "raw_text": "Aaron Sequeira\nSoftware/AI Engineer & Consultant\n\nH +97466900150/+919987726291 # aaronsequeira12@gmail.com Ñ Qatar / India\nï Aaron Sequeira § Github Leetcode Hackerrank\n\nProfile\nFull-Stack AI Engineer and Technical Consultant specializing in architecting and deploying end-to-end intelligent applications.\nProven expertise in building scalable backend systems, implementing MLOps pipelines, and leveraging Generative AI (RAG,\nLLMs) to solve complex business problems and to drive digital transformation from concept to production.\nEducation\nB-Tech in Information Technology Manipal University Jaipur, India 2021-2025\nCGPA: 7.93 Relevant Courses: OOPs, Data Structures & Analysis of Algorithms, Machine Learning, Web Technologies.\nSenior Secondary education Birla Public School Doha, Qatar 2008-2021\nClass 12th: 90.6% — Class 10: 89.6%\nProfessional Experience\nFull Stack AI/ML Developer (Remote) Smarter.Codes Remote 12/25 - Present\n• Building end-to-end web applications for clients (Uber, Ford, Target) that integrate NLP, web crawling, and RPA to automate data\nextraction and customer interactions for global enterprise projects.\nAI Researcher (Contract) Wood Engineering Qatar Doha, Qatar 12/25 - Present\n• Training ML models for CML asset life optimization using TensorFlow/PyTorch/MATLAB with 2100+ sample dataset, building\ncustom AI bots to extract relevant data fast; cutting down time by 97%. Delivering a RAG-based internal document search system\nusing LangChain/LlamaIndex with vector DBs (Qdrant) to cut document retrieval time by 65%.\nSoftware Engineer Lanco Engineering: Mannai Corporation (Client) Doha, Qatar 10/25 - 12/25\n• Developing and integrating AI-driven monitoring for the Border Information System, enhancing security across +1100 AXIS\nPTZ/Fixed cameras managed via Milestone VMS & Ipsotek, while deploying computer vision models (YOLO/TensorFlow)\nin Docker containers for real-time object detection and violation analysis, while reducing false alerts by 11%.\nSoftware Engineering Intern Baker Hughes Pune, India 09/24 - 09/25\n• Architected and deployed a Technical Service Portal & Laboratory Management System for Pune & Celle Tech Center using\nMicrosoft Power Platform, automating key workflows which reduced service downtime by 70%, with ensuring real-time tracking,\nauditing, and accelerated compliance validation by 40%. Tools: Power Platform, Microsoft 365 Dynamics. Engineered an\nend-to-end LLM-powered document intelligence system using a RAG architecture, cutting manual data entry by 75%. Deployed the\nsolution via a CI/CD pipeline on Azure. Tools: Python, React, LangChain, Azure AI, Docker.\nSkills\n• AI/ML: LLMs, RAG, LangChain, Prompt Engineering,\n\nComputer Vision (YOLO), TensorFlow, PyTorch, MAT-\nLAB\n\n• Programming & Databases: Python, JavaScript, Type-\nscript, C#, SQL, Bash, PostgreSQL, MongoDB, Qdrant\n\n• Cloud & DevOps: Azure, AWS, Docker\n• Frameworks & Platforms: React.js, Next.js, Node.js,\nTailwind CSS, Express.js, Flask, Django, FastAPI, Power\nPlatform\n• Developer Tools: JIRA, Postman, Github Actions\n\nKey Projects and Merits\n• 1st Place, LearnIT Hackathon: Won for creating a Gen-AI Browser tool. 3rd Place, University Hackathon 8.0:\nAwarded for an IoT & AI project revolutionizing urban traffic management. Best Prototype Award, ACM Student\nClub Mini Hacks 2.0: Won for a Smart Home Energy Saving project using C# and .NET, featuring an IoT dashboard\nwith real-time data visualization and a custom automation rules engine.\n• Google Developer Student Club & ACM Lead: Led technical operations for GDSC for Hackoberfest and as ACM\nLead, mentored 110+ students on building applications with RAG & LangChain.\n• Scholarship Recipient SPDC: Received a Merit Scholarship grant from the Qatar Government and Indian Embassy."
}